package net.guocheng.cheer.exercise.ch02;
//面向对象笔记
public class Notes 
{
	/*
	 * 对象(object),对象还有状态(state),行为(bdhavior),标识(identity);
	 * 				状态,一个对象用数据值来描述它的状态;
	 * 				操作,改变对象的状态,对象及其操作就是对象的行为
	 * 				对象实现了数据和操作的结合,是数据和操作封装于对象的统一体中
	 * 				对象是类抽象出来的一个实例
	 * 				由类构成(construct)对象的过程称为创建类的实例(instance)
	 * 类(class),类是对象模版,每个对象都是类的实例,new实例化类后才能用类的方法调用类功能
	 * 			类是同一类事物的统称,是封装对象的属性和行为的载体,类中对象的行为是以方法的形式定义的,
	 * 			对象的属性是以成员变量的形式定义的,类包括对象的属性和方法,
	 * 面向对象(ObjectOriented),面向对象的三大特点为,1.封装,2.继承,3.多态.
	 * 封装(encapsulation)数据隐藏,将数据和行为组合在一个包中,隐藏数据的实现方式
	 * 					不允许外部程序直接访问对象内部信息，而是通过该类所提供的方法来实现对内部信息的操作和访问
	 * 					指向子类的父类类型
	 * 实例域(instance field)对象中的数据,每个特定的类实例都有一组特定的实例值,这些值的集合就是这个对象的当前状态(state)
	 * 方法(method)操作数据的过程,将对象的属性和行为封装起来,其载体是类
	 * 继承(inheritance)通过扩展一个类来建立另外一个类的过程,继承性组要利用特定对象之间的共有属性,
	 * 多态(polymorphic)将父类对象应用于子类的特征,将子类对象统一看作父类的实例对象,
	 * 
	 */
}
